{
  "hackathon": {
    "fxheader": "?",
    "title": "What is a Hackathon?",
    "content": [
      "A hackathon is a design sprint-like event in which computer programmers and others involved in software development, including graphic designers,",
      " interface designers, project managers, and others, often including subject-matter-experts, collaborate intensively on software projects.",
      "The goal of a hackathon is to create usable software or hardware with the goal of creating a functioning product by the end of the event.",
      "Hackathons tend to have a specific focus, which can include the programming language used, the operating system, an application, an API, or the subject and the demographic group of the programmers.",
      "In other cases, there is no restriction on the type of software being created."
    ],
    "other": [
      {
        "href": "/faq/hack",
        "text": "Hacking..."
      }
    ]
  },
  "rules": {
    "fxheader": "Rules",
    "title": "What are Rules?",
    "content": [
      "Rules are a set of explicit or understood regulations or principles governing conduct within a particular activity or sphere.",
      "In the context of a hackathon, rules are the guidelines that participants must follow in order to ensure that the event runs smoothly and fairly.",
      "These rules may include restrictions on the use of certain technologies, requirements for the completion of a project, and guidelines for behavior and conduct during the event.",
      "By establishing clear rules and expectations, hackathon organizers can create an environment that encourages creativity, collaboration, and innovation among participants."
    ],
    "other": [
      {
        "href": "/faq/hackathon/",
        "text": "What is a Hackathon?"
      }
    ]
  },
  "hack": {
    "fxheader": "Hack",
    "title": "Hacking and its different meanings",
    "content": ["This is the hack page."],
    "other": [
      {
        "href": "/faq/hacking",
        "text": "Hack my Computer?"
      },
      {
        "href": "/faq/hack-meaning",
        "text": "What is a Hack?"
      },
      {
        "href": "/faq/hackathon",
        "text": "What is a Hackathon?"
      }
    ]
  },
  "hacking": {
    "fxheader": "Hack",
    "title": "What does Hacking mean?",
    "content": [
      "Hacking is easily confused with hacking into devices or systems, but it is not the same thing.",
      "Hacking is the act of finding a solution to a problem in a creative or unconventional way.",
      "The Product is called a Hack"
    ],
    "other": [
      {
        "href": "/faq/hack",
        "text": "Hacking"
      },
      {
        "href": "/faq/hack-meaning",
        "text": "What is a Hack?"
      },
      {
        "href": "/faq/hackathon",
        "text": "What is a Hackathon?"
      }
    ]
  },
  "hack-meaning": {
    "fxheader": "Hack",
    "title": "Hack my Computer?",
    "content": [
      "Hacking is easily confused with hacking into devices or systems, but it is not the same thing.",
      "Hacking is the act of finding a solution to a problem in a creative or unconventional way.",
      "The Product is called a Hack"
    ],
    "other": [
      {
        "href": "/faq/hack",
        "text": "Hacking"
      },
      {
        "href": "/faq/hacking",
        "text": "What does Hacking mean?"
      },
      {
        "href": "/faq/hackathon",
        "text": "What is a Hackathon?"
      }
    ]
  },
  "highschoolers": {
    "fxheader": "Only them?",
    "title": "A Hackathon only for Highschoolers?",
    "content": [
      "This is a hackathon that is specifically designed for high school students.",
      "It is an opportunity for students to come together and work on projects that interest them, learn new skills, and connect with other students who share their passion for technology.",
      "High school hackathons are a great way for students to gain hands-on experience with coding, design, and other technical skills, and to build their portfolios for college applications and future job opportunities."
    ],
    "other": [
      {
        "href": "/faq/hackathon",
        "text": "What is a Hackathon?"
      }
    ]
  }
}
